---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelRotation
source: html/2e547509-ab9d-3b63-070d-9606223f42e4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AnalyticalModelRotation Property

"Cross-Section Rotation": The rotation of Analytical Model

## Syntax (C#)
```csharp
public static ForgeTypeId AnalyticalModelRotation { get; }
```